/* DOM api 1~6 문제풀이

[1번]


1. 요구사항
    : 페이지가 로딩될 때 form 태그 안에 있는 텍스트 글씨(내용) 변경하기

2. input
    (1) 기존 p태그 내 데이터(txt)
    (2) 변경되는 데이터(txt)

3. 단계별 함수 설계
    (1) 변수 만들기(dom 요소 받을)
    (2) window.onload를 활용한 function()
    (3) p 태그에 innerText 로 나타낼 텍스트 입력

4. 단계별 구글링 키워드
    (1) 페이지 로딩 시 자바스크립트 이벤트 작동하는 법
    (2) 자바스크립트 txt 변경

-----
[2번]

1. 요구사항
    : 탭을 선택하면 선택한 탭의 배경과 글자의색이 바뀌도록 하시오

2. input
    (1) 사용자가 선택(클릭)할 탭 div
    (2) 각 탭 div 별 css 배경색과 글자색
    (3) div 클릭 시, 변경될 css 배경색과 글자색

3. 단계별 함수 설계
    (1) 

4. 단계별 구글링 키워드
    (1) 클릭이벤트, 선택한 요소 가져오기
    (2) 


*/